In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [19]:
orders_df = pd.read_csv('orders.csv')
orders_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [18]:
print('orders datatypes')
print(df_csv.dtypes)
print()
print('users datatypes')
print(df_json.dtypes)
print()
print('restaurants datatypes')
print(df_sql.dtypes)

orders datatypes
order_id             int64
user_id              int64
restaurant_id        int64
order_date          object
total_amount       float64
restaurant_name     object
dtype: object

users datatypes
user_id        int64
name          object
city          object
membership    object
dtype: object

restaurants datatypes
restaurant_id        int64
restaurant_name     object
cuisine             object
rating             float64
dtype: object

In [20]:
users_df = pd.read_json('users.json')
users_df.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [21]:
from sqlite3 import connect
conn = connect(':memory:')
cursor = conn.cursor()

with open('restaurants.sql', 'r') as f:
    sql_script = f.read()

cursor.executescript(sql_script)
conn.commit()

restaurants_df = pd.read_sql_query('select * from restaurants', conn)
restaurants_df.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [22]:
orders_users_df = orders_df.merge(users_df, on="user_id", how="left")
orders_users_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [23]:
df = orders_users_df.merge(restaurants_df, on="restaurant_id", how="left", suffixes=("_order", "_restaurant"))
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_order,name,city,membership,restaurant_name_restaurant,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [26]:
df.shape

(10000, 12)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   order_id                    10000 non-null  int64
 1   user_id                     10000 non-null  int64
 2   restaurant_id               10000 non-null  int64
 3   order_date                  10000 non-null  object
 4   total_amount                10000 non-null  float64
 5   restaurant_name_order       10000 non-null  object
 6   name                        10000 non-null  object
 7   city                        10000 non-null  object
 8   membership                  10000 non-null  object
 9   restaurant_name_restaurant  10000 non-null  object
 10  cuisine                     10000 non-null  object
 11  rating                      10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

In [29]:
df.drop(columns=['name', 'restaurant_name_restaurant'], axis=1, inplace=True)
df.sample(5)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_order,city,membership,cuisine,rating
6281,6282,1468,95,01-09-2023,743.94,Classic Biryani North Indian,Chennai,Gold,Indian,3.7
3827,3828,377,224,26-09-2023,1388.01,Darbar Kitchen Non-Veg,Bangalore,Gold,Chinese,4.8
1733,1734,477,110,22-01-2023,363.85,Amma Kitchen South Indian,Pune,Gold,Mexican,4.2
4575,4576,1094,83,02-12-2023,1104.57,Darbar Mess Pure Veg,Bangalore,Regular,Chinese,3.5
1389,1390,2747,77,11-11-2023,1216.50,Sri Mess Punjabi,Chennai,Regular,Mexican,4.4

In [30]:
df.to_csv('final_food_delivery_dataset.csv')
print('file saved successfully')

file saved successfully

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   order_id               10000 non-null  int64
 1   user_id                10000 non-null  int64
 2   restaurant_id          10000 non-null  int64
 3   order_date             10000 non-null  object
 4   total_amount           10000 non-null  float64
 5   restaurant_name_order  10000 non-null  object
 6   city                   10000 non-null  object
 7   membership             10000 non-null  object
 8   cuisine                10000 non-null  object
 9   rating                 10000 non-null  float64
dtypes: float64(2), int64(3), object(5)
memory usage: 781.4+ KB

In [33]:
# Which city has the highest total revenue (total_amount) from Gold members?  

gold_df = df[df["membership"] == "Gold"]

city_revenue = gold_df.groupby("city", as_index=False)["total_amount"].sum().sort_values("total_amount", ascending=False)

city_revenue

        city  total_amount
1    Chennai    1080909.79
3       Pune    1003012.32
0  Bangalore     994702.59
2  Hyderabad     896740.19

In [35]:
# Which cuisine has the highest average order value across all orders?
avg_order_value = df.groupby("cuisine", as_index=False)["total_amount"].mean().sort_values("total_amount", ascending=False)
avg_order_value

   cuisine  total_amount
3  Mexican    808.021344
2  Italian    799.448578
1   Indian    798.466011
0  Chinese    798.389020

In [39]:
# How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

# Total spend per user
user_total_spend = df.groupby("user_id")["total_amount"].sum()

# Count of users with total spend > 1000
high_value_users_count = len(user_total_spend[user_total_spend > 1000])
high_value_users_count

2544

In [41]:
# Which restaurant rating range generated the highest total revenue?

rating_bins = [3.0, 3.5, 4.0, 4.5, 5.0]
rating_labels = ["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]

df["rating_range"] = pd.cut(df["rating"],
    bins=rating_bins,
    labels=rating_labels,
    include_lowest=True
)

rating_revenue = df.groupby("rating_range", as_index=False)["total_amount"].sum().sort_values("total_amount", ascending=False)
rating_revenue

C:\Users\PiyushZawar\AppData\Local\Temp\ipykernel_19616\1076661912.py:12: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  rating_revenue = df.groupby("rating_range", as_index=False)["total_amount"].sum().sort_values("total_amount", ascending=False)

  rating_range  total_amount
3      4.6–5.0    2197030.75
0      3.0–3.5    2136772.70
2      4.1–4.5    1960326.26
1      3.6–4.0    1717494.41

In [42]:
# Among Gold members, city with highest average order value
gold_city_aov = df[df["membership"] == "Gold"].groupby("city", as_index=False)["total_amount"].mean().sort_values("total_amount", ascending=False)
gold_city_aov

        city  total_amount
1    Chennai    808.459080
2  Hyderabad    806.421034
0  Bangalore    793.223756
3       Pune    781.162243

In [43]:
df.groupby("cuisine").agg(distinct_restaurants=("restaurant_id","nunique"), total_revenue=("total_amount","sum")).sort_values(["distinct_restaurants","total_revenue"], ascending=[True, False])

         distinct_restaurants  total_revenue
cuisine
Chinese                   120     1930504.65
Italian                   126     2024203.80
Indian                    126     1971412.58
Mexican                   128     2085503.09

In [44]:
# What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

percentage_gold_orders = round((df[df["membership"] == "Gold"].shape[0] / df.shape[0]) * 100)
percentage_gold_orders

50

In [60]:
df.sample(2)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_order,city,membership,cuisine,rating,rating_range
1413,1414,2340,37,2023-09-10,545.85,Swagath Dhaba Andhra,Pune,Gold,Mexican,3.1,3.0–3.5
397,398,96,263,2023-07-20,904.25,Grand Curry House Andhra,Pune,Regular,Indian,4.4,4.1–4.5

In [67]:
# Which restaurant has the highest average order value but less than 20 total orders?

# Filter required restaurants
filtered_df = df[df["restaurant_name_order"].isin([
    "Grand Cafe Punjabi",
    "Grand Restaurant South Indian",
    "Ruchi Mess Multicuisine",
    "Ruchi Foods Chinese"
])]

filtered_df

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_order,city,membership,cuisine,rating,rating_range
13,14,364,112,2023-09-24,898.24,Grand Cafe Punjabi,Chennai,Gold,Chinese,3.2,3.0–3.5
16,17,1896,421,2023-04-09,1002.51,Ruchi Foods Chinese,Pune,Regular,Indian,3.0,3.0–3.5
86,87,1750,385,2023-04-14,1103.42,Ruchi Mess Multicuisine,Pune,Gold,Chinese,4.4,4.1–4.5
130,131,2850,389,2023-08-10,1406.07,Ruchi Mess Multicuisine,Hyderabad,Gold,Italian,4.9,4.6–5.0
141,142,1860,112,2023-02-07,1331.64,Grand Cafe Punjabi,Chennai,Gold,Chinese,3.2,3.0–3.5
...,...,...,...,...,...,...,...,...,...,...,...
9608,9609,1766,389,2023-01-02,1186.33,Ruchi Mess Multicuisine,Hyderabad,Regular,Italian,4.9,4.6–5.0
9806,9807,1297,421,2023-03-11,993.06,Ruchi Foods Chinese,Hyderabad,Regular,Indian,3.0,3.0–3.5
9849,9850,2797,112,2023-04-16,1250.15,Grand Cafe Punjabi,Hyderabad,Gold,Chinese,3.2,3.0–3.5
9911,9912,2420,116,2023-01-09,373.95,Grand Cafe Punjabi,Chennai,Gold,Chinese,4.2,4.1–4.5
9957,9958,1425,385,2023-04-13,612.50,Ruchi Mess Multicuisine,Pune,Regular,Chinese,4.4,4.1–4.5

In [68]:
# Count orders and average order value per restaurant
stats = filtered_df.groupby("restaurant_name_order").agg(
    avg_order_value=("total_amount", "mean"),
    total_orders=("order_id", "count")
)

stats

                               avg_order_value  total_orders
restaurant_name_order
Grand Cafe Punjabi                  765.409063            32
Grand Restaurant South Indian       842.567586            29
Ruchi Foods Chinese                 686.603158            19
Ruchi Mess Multicuisine             851.226250            40

In [69]:
stats = stats[stats["total_orders"] < 20]
stats

                       avg_order_value  total_orders
restaurant_name_order
Ruchi Foods Chinese         686.603158            19

In [63]:
# Which combination contributes the highest revenue?
df[
    (df["membership"].isin(["Gold", "Regular"])) &
    (
        ((df["membership"] == "Gold") & (df["cuisine"].isin(["Indian", "Italian"]))) |
        ((df["membership"] == "Regular") & (df["cuisine"].isin(["Indian", "Chinese"])))
    )
].groupby(["membership", "cuisine"])["total_amount"].sum().sort_values(ascending=False)

membership  cuisine
Gold        Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [50]:
# During which quarter of the year is the total revenue highest?
df["order_date"] = pd.to_datetime(df["order_date"], errors="coerce")

df.assign(
    order_date=pd.to_datetime(df["order_date"]),
    quarter=df["order_date"].dt.to_period("Q").astype(str)
).groupby("quarter")["total_amount"].sum().idxmax()

C:\Users\PiyushZawar\AppData\Local\Temp\ipykernel_19616\1777751937.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df["order_date"] = pd.to_datetime(df["order_date"], errors="coerce")

'2023Q3'

In [52]:
# How many total orders were placed by users with Gold membership?

df[df["membership"] == "Gold"].shape[0]

4987

In [54]:
# What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

round(df.loc[df["city"] == "Hyderabad", "total_amount"].sum())

1889367

In [55]:
# How many distinct users placed at least one order?
df["user_id"].nunique()

2883

In [56]:
# What is the average order value (rounded to 2 decimals) for Gold members?
round(df.loc[df["membership"] == "Gold", "total_amount"].mean(), 2)

np.float64(797.15)

In [57]:
# How many orders were placed for restaurants with rating ≥ 4.5?
(df["rating"] >= 4.5).sum()

np.int64(3374)

In [58]:
# How many orders were placed in the top revenue city among Gold members only?

# Top revenue city among Gold members
top_city = df[df["membership"] == "Gold"].groupby("city")["total_amount"].sum().idxmax()
top_city

'Chennai'

In [59]:
# Number of orders from Chennai city (Gold members only)
df[(df["membership"] == "Gold") & (df["city"] == 'Chennai')].shape[0]

1337